Concate DataFrams :

In [1]:
import pandas as pd

In [2]:
india_weather = {
    'city' : ["Mumbai", 'Indore', 'Kolkata'],
    'temperature': [39, 35, 40],
    'humidity' : [98, 76, 94],
}

india_weather

{'city': ['Mumbai', 'Indore', 'Kolkata'],
 'temperature': [39, 35, 40],
 'humidity': [98, 76, 94]}

In [3]:
df1 = pd.DataFrame(india_weather)
df1

      city  temperature  humidity
0   Mumbai           39        98
1   Indore           35        76
2  Kolkata           40        94

In [4]:
us_weather = {
    'city' : ["San Diago", 'San Francisco', 'New York'],
    'temperature': [28, 30, 34],
    'humidity' : [90, 87, 76],
}

df2 = pd.DataFrame(us_weather)

In [6]:
df = pd.concat([df1, df2], ignore_index=True)
df

            city  temperature  humidity
0         Mumbai           39        98
1         Indore           35        76
2        Kolkata           40        94
3      San Diago           28        90
4  San Francisco           30        87
5       New York           34        76

using keys arg as if we want to retrive the data for a particular data

In [7]:
new_df = pd.concat([df1, df2], keys=["India", "USA"])
new_df

                  city  temperature  humidity
India 0         Mumbai           39        98
      1         Indore           35        76
      2        Kolkata           40        94
USA   0      San Diago           28        90
      1  San Francisco           30        87
      2       New York           34        76

In [8]:
new_df.loc["India"]

      city  temperature  humidity
0   Mumbai           39        98
1   Indore           35        76
2  Kolkata           40        94

Use Of axis : concat can be done both ways row and column

In [9]:
temp_df = pd.DataFrame({
    'city' : ["Mumbai", 'Indore', 'Kolkata'],
    'temperature': [39, 35, 40],
})
temp_df

      city  temperature
0   Mumbai           39
1   Indore           35
2  Kolkata           40

In [15]:
windSpeed_df = pd.DataFrame({
    'city' : ["Indore", 'Mumbai', 'Kolkata'],
    'windspeed': [6,8, 2],
}, index=[1, 0, 2])
windSpeed_df

      city  windspeed
1   Indore          6
0   Mumbai          8
2  Kolkata          2

In [17]:
temp_Wind_df = pd.concat([temp_df, windSpeed_df], axis=1)
temp_Wind_df

      city  temperature     city  windspeed
0   Mumbai           39   Mumbai          8
1   Indore           35   Indore          6
2  Kolkata           40  Kolkata          2

In [19]:
s = pd.Series(["Humid", "Rain", "Sunny"], name="Event")
s

0    Humid
1     Rain
2    Sunny
Name: Event, dtype: object

In [20]:
new_temp_df = pd.concat([temp_df, s], axis=1)
new_temp_df

      city  temperature  Event
0   Mumbai           39  Humid
1   Indore           35   Rain
2  Kolkata           40  Sunny